Repository: KLEAK-Development/tic_tac_toe
Catalog: lib/src/core/l10n/arb/app_*.arb
Languages: de, es

source: New Game
de: Neues Spiel
es: Nueva Partida

# singlePlayerGame
source: vs Computer
de: gegen Computer

source: Two Player Game
de: Zwei-Spieler-Spiel
es: Juego de Dos Jugadores

source: Player X
de: Spieler X
es: Jugador X

source: Player O
de: Spieler O
es: Jugador O

# playerTurn
source: {player}'s Turn
de: {player} ist dran
es: Turno de {player}

source: Player X Wins!
de: Spieler X Gewinnt!
es: ¡Jugador X Gana!

source: Player O Wins!
de: Spieler O Gewinnt!
es: ¡Jugador O Gana!

# draw
source: It's a Draw!
de: Unentschieden!
es: ¡Empate!

# gameEndedDraw
source: The game ended in a draw!
de: Das Spiel endete unentschieden!
es: ¡La partida terminó en empate!

# playerWonGame
source: {player} has won the game!
de: {player} hat das Spiel gewonnen!
es: ¡{player} ha ganado la partida!

source: Reset Game
de: Zurücksetzen
es: Reiniciar

source: Play Again
de: Nochmal Spielen
es: Jugar de Nuevo

source: Language
de: Sprache
es: Idioma

# languageSystemDefault
source: System Default
de: Systemstandard
es: Predeterminado

source: Theme
de: Design
es: Tema

# themeSystemDefault
source: System Default
de: Systemstandard
es: Predeterminado

# themeLight
source: Light
de: Hell
es: Claro

# themeDark
source: Dark
de: Dunkel
es: Oscuro

# semanticCellEmpty
source: Cell {cellNumber}, empty
de: Feld {cellNumber}, leer
es: Casilla {cellNumber}, vacía

# semanticCellFilled
source: Cell {cellNumber}, filled with {symbol}
de: Feld {cellNumber}, gefüllt mit {symbol}
es: Casilla {cellNumber}, llena con {symbol}

# semanticGameStatus
source: Game status
de: Spielstatus
es: Estado del juego

# appInitializationError
source: Failed to initialize app
de: Fehler beim Initialisieren der App
es: Error al inicializar la aplicación

source: Retry
de: Wiederholen
es: Reintentar

# appTitle
source: Tic Tac Toe
es: Tres en Raya
